class WorkoutModel:
    @staticmethod
    def process(data):
        # Пример обработки данных для создания программы тренировок
        # Здесь можно добавить логику обработки данных и генерации программы тренировок
        return {'message': 'АЖУМАНИЙ, ТУРНИК ПОСЯГИВАСА, БЕГИТ, СКОКАЛКА ПРИГИТ, ЖИВОТ КАШАТ'}

class DietModel:
    @staticmethod
    def process(data):
        # Пример обработки данных для создания программы диеты
        # Здесь можно добавить логику обработки данных и генерации диеты
        return {'message': 'БЕЛОК ЭТО ЖЕЛТОК, ЕГО МНОГО В САЛО, ОХУРЦЫ, МЯСО'}
